multiplyMatrix = require('./task1.js');

// Нехай задано дві прямокутні матриці **A** та **B** розмірності **m** × **n** та **n** × **q** відповідно:
// *(малюнки до завданнь на трьох останніх сторінках презентації Лекції№6)*
//
// Тоді матриця **C** розмірності **m** × **q** називається їх добутком:
//
//     *(малюнок до завдання на трьох останніх сторінках презентації Лекції№6)*
//
// Знайти матрицю C.
//
// *(малюнок до завдання на трьох останніх сторінках презентації Лекції№6)*


test('Search C matrix', () => {
    let A = [
        [1, 2, 3],
        [4, 5, 6]
    ];
    let B = [
        [7, 8],
        [9, 10],
        [11, 12]
    ];
    let C = multiplyMatrix(A, B);
    let expected = [
        [58, 64],
        [139, 154]
    ];
    expect(C).toEqual(expected);
});